espressif/esp-idf/components/soc/esp32s31/register/soc/hp_alive_sys_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** HP_ALIVE_SYS_HP_CLK_CTRL_REG register
 *  HP Clock Control Register.
 */
#define HP_ALIVE_SYS_HP_CLK_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x0)
/** HP_ALIVE_SYS_HP_XTALX2_80M_CLK_EN : R/W; bitpos: [17]; default: 1;
 *  XTALx2 80M Clock Enable.
 */
#define HP_ALIVE_SYS_HP_XTALX2_80M_CLK_EN    (BIT(17))
#define HP_ALIVE_SYS_HP_XTALX2_80M_CLK_EN_M  (HP_ALIVE_SYS_HP_XTALX2_80M_CLK_EN_V << HP_ALIVE_SYS_HP_XTALX2_80M_CLK_EN_S)
#define HP_ALIVE_SYS_HP_XTALX2_80M_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_XTALX2_80M_CLK_EN_S  17
/** HP_ALIVE_SYS_HP_ROOT_CLK_EN : R/W; bitpos: [18]; default: 1;
 *  HP SoC Root Clock Enable.
 */
#define HP_ALIVE_SYS_HP_ROOT_CLK_EN    (BIT(18))
#define HP_ALIVE_SYS_HP_ROOT_CLK_EN_M  (HP_ALIVE_SYS_HP_ROOT_CLK_EN_V << HP_ALIVE_SYS_HP_ROOT_CLK_EN_S)
#define HP_ALIVE_SYS_HP_ROOT_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_ROOT_CLK_EN_S  18
/** HP_ALIVE_SYS_HP_XTAL_32K_CLK_EN : R/W; bitpos: [19]; default: 1;
 *  XTAL 32K Clock Enable.
 */
#define HP_ALIVE_SYS_HP_XTAL_32K_CLK_EN    (BIT(19))
#define HP_ALIVE_SYS_HP_XTAL_32K_CLK_EN_M  (HP_ALIVE_SYS_HP_XTAL_32K_CLK_EN_V << HP_ALIVE_SYS_HP_XTAL_32K_CLK_EN_S)
#define HP_ALIVE_SYS_HP_XTAL_32K_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_XTAL_32K_CLK_EN_S  19
/** HP_ALIVE_SYS_HP_RC_32K_CLK_EN : R/W; bitpos: [20]; default: 1;
 *  RC 32K Clock Enable.
 */
#define HP_ALIVE_SYS_HP_RC_32K_CLK_EN    (BIT(20))
#define HP_ALIVE_SYS_HP_RC_32K_CLK_EN_M  (HP_ALIVE_SYS_HP_RC_32K_CLK_EN_V << HP_ALIVE_SYS_HP_RC_32K_CLK_EN_S)
#define HP_ALIVE_SYS_HP_RC_32K_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_RC_32K_CLK_EN_S  20
/** HP_ALIVE_SYS_HP_SOSC_150K_CLK_EN : R/W; bitpos: [21]; default: 1;
 *  SOSC 150K Clock Enable.
 */
#define HP_ALIVE_SYS_HP_SOSC_150K_CLK_EN    (BIT(21))
#define HP_ALIVE_SYS_HP_SOSC_150K_CLK_EN_M  (HP_ALIVE_SYS_HP_SOSC_150K_CLK_EN_V << HP_ALIVE_SYS_HP_SOSC_150K_CLK_EN_S)
#define HP_ALIVE_SYS_HP_SOSC_150K_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_SOSC_150K_CLK_EN_S  21
/** HP_ALIVE_SYS_HP_PLL_80M_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  PLL 8M Clock Enable.
 */
#define HP_ALIVE_SYS_HP_PLL_80M_CLK_EN    (BIT(22))
#define HP_ALIVE_SYS_HP_PLL_80M_CLK_EN_M  (HP_ALIVE_SYS_HP_PLL_80M_CLK_EN_V << HP_ALIVE_SYS_HP_PLL_80M_CLK_EN_S)
#define HP_ALIVE_SYS_HP_PLL_80M_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_PLL_80M_CLK_EN_S  22
/** HP_ALIVE_SYS_HP_AUDIO_PLL_CLK_EN : R/W; bitpos: [23]; default: 1;
 *  AUDIO PLL Clock Enable.
 */
#define HP_ALIVE_SYS_HP_AUDIO_PLL_CLK_EN    (BIT(23))
#define HP_ALIVE_SYS_HP_AUDIO_PLL_CLK_EN_M  (HP_ALIVE_SYS_HP_AUDIO_PLL_CLK_EN_V << HP_ALIVE_SYS_HP_AUDIO_PLL_CLK_EN_S)
#define HP_ALIVE_SYS_HP_AUDIO_PLL_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_AUDIO_PLL_CLK_EN_S  23
/** HP_ALIVE_SYS_HP_SDIO_PLL2_CLK_EN : R/W; bitpos: [24]; default: 1;
 *  reserved
 */
#define HP_ALIVE_SYS_HP_SDIO_PLL2_CLK_EN    (BIT(24))
#define HP_ALIVE_SYS_HP_SDIO_PLL2_CLK_EN_M  (HP_ALIVE_SYS_HP_SDIO_PLL2_CLK_EN_V << HP_ALIVE_SYS_HP_SDIO_PLL2_CLK_EN_S)
#define HP_ALIVE_SYS_HP_SDIO_PLL2_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_SDIO_PLL2_CLK_EN_S  24
/** HP_ALIVE_SYS_HP_SDIO_PLL1_CLK_EN : R/W; bitpos: [25]; default: 1;
 *  reserved
 */
#define HP_ALIVE_SYS_HP_SDIO_PLL1_CLK_EN    (BIT(25))
#define HP_ALIVE_SYS_HP_SDIO_PLL1_CLK_EN_M  (HP_ALIVE_SYS_HP_SDIO_PLL1_CLK_EN_V << HP_ALIVE_SYS_HP_SDIO_PLL1_CLK_EN_S)
#define HP_ALIVE_SYS_HP_SDIO_PLL1_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_SDIO_PLL1_CLK_EN_S  25
/** HP_ALIVE_SYS_HP_SDIO_PLL0_CLK_EN : R/W; bitpos: [26]; default: 1;
 *  reserved
 */
#define HP_ALIVE_SYS_HP_SDIO_PLL0_CLK_EN    (BIT(26))
#define HP_ALIVE_SYS_HP_SDIO_PLL0_CLK_EN_M  (HP_ALIVE_SYS_HP_SDIO_PLL0_CLK_EN_V << HP_ALIVE_SYS_HP_SDIO_PLL0_CLK_EN_S)
#define HP_ALIVE_SYS_HP_SDIO_PLL0_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_SDIO_PLL0_CLK_EN_S  26
/** HP_ALIVE_SYS_HP_FOSC_20M_CLK_EN : R/W; bitpos: [27]; default: 1;
 *  FOSC 20M Clock Enable.
 */
#define HP_ALIVE_SYS_HP_FOSC_20M_CLK_EN    (BIT(27))
#define HP_ALIVE_SYS_HP_FOSC_20M_CLK_EN_M  (HP_ALIVE_SYS_HP_FOSC_20M_CLK_EN_V << HP_ALIVE_SYS_HP_FOSC_20M_CLK_EN_S)
#define HP_ALIVE_SYS_HP_FOSC_20M_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_FOSC_20M_CLK_EN_S  27
/** HP_ALIVE_SYS_HP_XTAL_40M_CLK_EN : R/W; bitpos: [28]; default: 1;
 *  XTAL 40M Clock Enable.
 */
#define HP_ALIVE_SYS_HP_XTAL_40M_CLK_EN    (BIT(28))
#define HP_ALIVE_SYS_HP_XTAL_40M_CLK_EN_M  (HP_ALIVE_SYS_HP_XTAL_40M_CLK_EN_V << HP_ALIVE_SYS_HP_XTAL_40M_CLK_EN_S)
#define HP_ALIVE_SYS_HP_XTAL_40M_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_XTAL_40M_CLK_EN_S  28
/** HP_ALIVE_SYS_HP_CPLL_300M_CLK_EN : R/W; bitpos: [29]; default: 1;
 *  CPLL 300M Clock Enable.
 */
#define HP_ALIVE_SYS_HP_CPLL_300M_CLK_EN    (BIT(29))
#define HP_ALIVE_SYS_HP_CPLL_300M_CLK_EN_M  (HP_ALIVE_SYS_HP_CPLL_300M_CLK_EN_V << HP_ALIVE_SYS_HP_CPLL_300M_CLK_EN_S)
#define HP_ALIVE_SYS_HP_CPLL_300M_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_CPLL_300M_CLK_EN_S  29
/** HP_ALIVE_SYS_HP_SPLL_480M_CLK_EN : R/W; bitpos: [30]; default: 1;
 *  SPLL 480M Clock Enable.
 */
#define HP_ALIVE_SYS_HP_SPLL_480M_CLK_EN    (BIT(30))
#define HP_ALIVE_SYS_HP_SPLL_480M_CLK_EN_M  (HP_ALIVE_SYS_HP_SPLL_480M_CLK_EN_V << HP_ALIVE_SYS_HP_SPLL_480M_CLK_EN_S)
#define HP_ALIVE_SYS_HP_SPLL_480M_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_SPLL_480M_CLK_EN_S  30
/** HP_ALIVE_SYS_HP_MPLL_500M_CLK_EN : R/W; bitpos: [31]; default: 1;
 *  MPLL 500M Clock Enable.
 */
#define HP_ALIVE_SYS_HP_MPLL_500M_CLK_EN    (BIT(31))
#define HP_ALIVE_SYS_HP_MPLL_500M_CLK_EN_M  (HP_ALIVE_SYS_HP_MPLL_500M_CLK_EN_V << HP_ALIVE_SYS_HP_MPLL_500M_CLK_EN_S)
#define HP_ALIVE_SYS_HP_MPLL_500M_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_MPLL_500M_CLK_EN_S  31

/** HP_ALIVE_SYS_HP_PAD_PARLIO_CTRL_REG register
 *  HP Clock Control Register.
 */
#define HP_ALIVE_SYS_HP_PAD_PARLIO_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x4)
/** HP_ALIVE_SYS_HP_PAD_PARLIO_TX_CLK_EN : R/W; bitpos: [30]; default: 1;
 *  PARLIO TX Clock From Pad Enable.
 */
#define HP_ALIVE_SYS_HP_PAD_PARLIO_TX_CLK_EN    (BIT(30))
#define HP_ALIVE_SYS_HP_PAD_PARLIO_TX_CLK_EN_M  (HP_ALIVE_SYS_HP_PAD_PARLIO_TX_CLK_EN_V << HP_ALIVE_SYS_HP_PAD_PARLIO_TX_CLK_EN_S)
#define HP_ALIVE_SYS_HP_PAD_PARLIO_TX_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_PAD_PARLIO_TX_CLK_EN_S  30
/** HP_ALIVE_SYS_HP_PAD_PARLIO_RX_CLK_EN : R/W; bitpos: [31]; default: 1;
 *  PARLIO RX Clock From Pad Enable.
 */
#define HP_ALIVE_SYS_HP_PAD_PARLIO_RX_CLK_EN    (BIT(31))
#define HP_ALIVE_SYS_HP_PAD_PARLIO_RX_CLK_EN_M  (HP_ALIVE_SYS_HP_PAD_PARLIO_RX_CLK_EN_V << HP_ALIVE_SYS_HP_PAD_PARLIO_RX_CLK_EN_S)
#define HP_ALIVE_SYS_HP_PAD_PARLIO_RX_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_PAD_PARLIO_RX_CLK_EN_S  31

/** HP_ALIVE_SYS_HP_PAD_I2S0_CTRL_REG register
 *  HP Clock Control Register.
 */
#define HP_ALIVE_SYS_HP_PAD_I2S0_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x8)
/** HP_ALIVE_SYS_HP_PAD_I2S0_MCLK_EN : R/W; bitpos: [31]; default: 1;
 *  I2S0 MCLK Clock From Pad Enable.
 */
#define HP_ALIVE_SYS_HP_PAD_I2S0_MCLK_EN    (BIT(31))
#define HP_ALIVE_SYS_HP_PAD_I2S0_MCLK_EN_M  (HP_ALIVE_SYS_HP_PAD_I2S0_MCLK_EN_V << HP_ALIVE_SYS_HP_PAD_I2S0_MCLK_EN_S)
#define HP_ALIVE_SYS_HP_PAD_I2S0_MCLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_PAD_I2S0_MCLK_EN_S  31

/** HP_ALIVE_SYS_HP_PAD_I2S1_CTRL_REG register
 *  HP Clock Control Register.
 */
#define HP_ALIVE_SYS_HP_PAD_I2S1_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0xc)
/** HP_ALIVE_SYS_HP_PAD_I2S1_MCLK_EN : R/W; bitpos: [31]; default: 1;
 *  I2S1 MCLK Clock From Pad Enable.
 */
#define HP_ALIVE_SYS_HP_PAD_I2S1_MCLK_EN    (BIT(31))
#define HP_ALIVE_SYS_HP_PAD_I2S1_MCLK_EN_M  (HP_ALIVE_SYS_HP_PAD_I2S1_MCLK_EN_V << HP_ALIVE_SYS_HP_PAD_I2S1_MCLK_EN_S)
#define HP_ALIVE_SYS_HP_PAD_I2S1_MCLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_PAD_I2S1_MCLK_EN_S  31

/** HP_ALIVE_SYS_HP_PAD_UART0_CTRL_REG register
 *  HP Clock Control Register.
 */
#define HP_ALIVE_SYS_HP_PAD_UART0_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x10)
/** HP_ALIVE_SYS_HP_PAD_UART0_SLP_CLK_EN : R/W; bitpos: [31]; default: 1;
 *  UART0 SLP Clock From Pad Enable.
 */
#define HP_ALIVE_SYS_HP_PAD_UART0_SLP_CLK_EN    (BIT(31))
#define HP_ALIVE_SYS_HP_PAD_UART0_SLP_CLK_EN_M  (HP_ALIVE_SYS_HP_PAD_UART0_SLP_CLK_EN_V << HP_ALIVE_SYS_HP_PAD_UART0_SLP_CLK_EN_S)
#define HP_ALIVE_SYS_HP_PAD_UART0_SLP_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_PAD_UART0_SLP_CLK_EN_S  31

/** HP_ALIVE_SYS_HP_PAD_UART1_CTRL_REG register
 *  HP Clock Control Register.
 */
#define HP_ALIVE_SYS_HP_PAD_UART1_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x14)
/** HP_ALIVE_SYS_HP_PAD_UART1_SLP_CLK_EN : R/W; bitpos: [31]; default: 1;
 *  UART1 SLP Clock From Pad Enable.
 */
#define HP_ALIVE_SYS_HP_PAD_UART1_SLP_CLK_EN    (BIT(31))
#define HP_ALIVE_SYS_HP_PAD_UART1_SLP_CLK_EN_M  (HP_ALIVE_SYS_HP_PAD_UART1_SLP_CLK_EN_V << HP_ALIVE_SYS_HP_PAD_UART1_SLP_CLK_EN_S)
#define HP_ALIVE_SYS_HP_PAD_UART1_SLP_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_PAD_UART1_SLP_CLK_EN_S  31

/** HP_ALIVE_SYS_HP_PAD_UART2_CTRL_REG register
 *  HP Clock Control Register.
 */
#define HP_ALIVE_SYS_HP_PAD_UART2_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x18)
/** HP_ALIVE_SYS_HP_PAD_UART2_SLP_CLK_EN : R/W; bitpos: [31]; default: 1;
 *  UART2 SLP Clock From Pad Enable.
 */
#define HP_ALIVE_SYS_HP_PAD_UART2_SLP_CLK_EN    (BIT(31))
#define HP_ALIVE_SYS_HP_PAD_UART2_SLP_CLK_EN_M  (HP_ALIVE_SYS_HP_PAD_UART2_SLP_CLK_EN_V << HP_ALIVE_SYS_HP_PAD_UART2_SLP_CLK_EN_S)
#define HP_ALIVE_SYS_HP_PAD_UART2_SLP_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_PAD_UART2_SLP_CLK_EN_S  31

/** HP_ALIVE_SYS_HP_PAD_UART3_CTRL_REG register
 *  HP Clock Control Register.
 */
#define HP_ALIVE_SYS_HP_PAD_UART3_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x1c)
/** HP_ALIVE_SYS_HP_PAD_UART3_SLP_CLK_EN : R/W; bitpos: [31]; default: 1;
 *  UART3 SLP Clock From Pad Enable.
 */
#define HP_ALIVE_SYS_HP_PAD_UART3_SLP_CLK_EN    (BIT(31))
#define HP_ALIVE_SYS_HP_PAD_UART3_SLP_CLK_EN_M  (HP_ALIVE_SYS_HP_PAD_UART3_SLP_CLK_EN_V << HP_ALIVE_SYS_HP_PAD_UART3_SLP_CLK_EN_S)
#define HP_ALIVE_SYS_HP_PAD_UART3_SLP_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_PAD_UART3_SLP_CLK_EN_S  31

/** HP_ALIVE_SYS_MODEM_CLK_AON_REG register
 *  need_des
 */
#define HP_ALIVE_SYS_MODEM_CLK_AON_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x20)
/** HP_ALIVE_SYS_MODEM_CLK_AON_SEL : R/W; bitpos: [31]; default: 1;
 *  Modem clk aon sel. 0: foscl  1:xtal
 */
#define HP_ALIVE_SYS_MODEM_CLK_AON_SEL    (BIT(31))
#define HP_ALIVE_SYS_MODEM_CLK_AON_SEL_M  (HP_ALIVE_SYS_MODEM_CLK_AON_SEL_V << HP_ALIVE_SYS_MODEM_CLK_AON_SEL_S)
#define HP_ALIVE_SYS_MODEM_CLK_AON_SEL_V  0x00000001U
#define HP_ALIVE_SYS_MODEM_CLK_AON_SEL_S  31

/** HP_ALIVE_SYS_USB_CTRL_REG register
 *  need_des
 */
#define HP_ALIVE_SYS_USB_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x24)
/** HP_ALIVE_SYS_USB_OTGHS_PHY_CHRGVBUS : R/W; bitpos: [0]; default: 0;
 *  phy chrgvbus
 */
#define HP_ALIVE_SYS_USB_OTGHS_PHY_CHRGVBUS    (BIT(0))
#define HP_ALIVE_SYS_USB_OTGHS_PHY_CHRGVBUS_M  (HP_ALIVE_SYS_USB_OTGHS_PHY_CHRGVBUS_V << HP_ALIVE_SYS_USB_OTGHS_PHY_CHRGVBUS_S)
#define HP_ALIVE_SYS_USB_OTGHS_PHY_CHRGVBUS_V  0x00000001U
#define HP_ALIVE_SYS_USB_OTGHS_PHY_CHRGVBUS_S  0
/** HP_ALIVE_SYS_USB_OTGHS_PHY_DISCHRGVBUS : R/W; bitpos: [1]; default: 0;
 *  phy dischrgvbus
 */
#define HP_ALIVE_SYS_USB_OTGHS_PHY_DISCHRGVBUS    (BIT(1))
#define HP_ALIVE_SYS_USB_OTGHS_PHY_DISCHRGVBUS_M  (HP_ALIVE_SYS_USB_OTGHS_PHY_DISCHRGVBUS_V << HP_ALIVE_SYS_USB_OTGHS_PHY_DISCHRGVBUS_S)
#define HP_ALIVE_SYS_USB_OTGHS_PHY_DISCHRGVBUS_V  0x00000001U
#define HP_ALIVE_SYS_USB_OTGHS_PHY_DISCHRGVBUS_S  1
/** HP_ALIVE_SYS_USB_OTGHS_PHY_DMPULLDOWN : R/W; bitpos: [2]; default: 0;
 *  phy dmpulldown
 */
#define HP_ALIVE_SYS_USB_OTGHS_PHY_DMPULLDOWN    (BIT(2))
#define HP_ALIVE_SYS_USB_OTGHS_PHY_DMPULLDOWN_M  (HP_ALIVE_SYS_USB_OTGHS_PHY_DMPULLDOWN_V << HP_ALIVE_SYS_USB_OTGHS_PHY_DMPULLDOWN_S)
#define HP_ALIVE_SYS_USB_OTGHS_PHY_DMPULLDOWN_V  0x00000001U
#define HP_ALIVE_SYS_USB_OTGHS_PHY_DMPULLDOWN_S  2
/** HP_ALIVE_SYS_USB_OTGHS_PHY_DPPULLDOWN : R/W; bitpos: [3]; default: 0;
 *  phy dppulldown
 */
#define HP_ALIVE_SYS_USB_OTGHS_PHY_DPPULLDOWN    (BIT(3))
#define HP_ALIVE_SYS_USB_OTGHS_PHY_DPPULLDOWN_M  (HP_ALIVE_SYS_USB_OTGHS_PHY_DPPULLDOWN_V << HP_ALIVE_SYS_USB_OTGHS_PHY_DPPULLDOWN_S)
#define HP_ALIVE_SYS_USB_OTGHS_PHY_DPPULLDOWN_V  0x00000001U
#define HP_ALIVE_SYS_USB_OTGHS_PHY_DPPULLDOWN_S  3
/** HP_ALIVE_SYS_USB_OTGHS_PHY_IDPULLUP : R/W; bitpos: [4]; default: 0;
 *  phy idpullup
 */
#define HP_ALIVE_SYS_USB_OTGHS_PHY_IDPULLUP    (BIT(4))
#define HP_ALIVE_SYS_USB_OTGHS_PHY_IDPULLUP_M  (HP_ALIVE_SYS_USB_OTGHS_PHY_IDPULLUP_V << HP_ALIVE_SYS_USB_OTGHS_PHY_IDPULLUP_S)
#define HP_ALIVE_SYS_USB_OTGHS_PHY_IDPULLUP_V  0x00000001U
#define HP_ALIVE_SYS_USB_OTGHS_PHY_IDPULLUP_S  4

