espressif/esp-idf/components/soc/esp32s31/register/soc/hp_alive_sys_reg.h
/** HP_ALIVE_SYS_HP_TCM_MEM_LP_CTRL_REG register
 *  configure rmemory power in lp system register
 */
#define HP_ALIVE_SYS_HP_TCM_MEM_LP_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x28)
/** HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures layer0  hp_sram memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_MODE    0x00000003U
#define HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_MODE_M  (HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_MODE_V << HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_MODE_S)
#define HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_MODE_V  0x00000003U
#define HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_MODE_S  0
/** HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down layer0 hp_sram memory.
 */
#define HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_EN    (BIT(2))
#define HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_EN_M  (HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_EN_V << HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_EN_S)
#define HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_TCM_L0_MEM_LP_EN_S  2
/** HP_ALIVE_SYS_HP_TCM_MEM_L0_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control layer0 hp_sram memory, disable hardware
 *  control.
 */
#define HP_ALIVE_SYS_HP_TCM_MEM_L0_LP_FORCE_CTRL    (BIT(3))
#define HP_ALIVE_SYS_HP_TCM_MEM_L0_LP_FORCE_CTRL_M  (HP_ALIVE_SYS_HP_TCM_MEM_L0_LP_FORCE_CTRL_V << HP_ALIVE_SYS_HP_TCM_MEM_L0_LP_FORCE_CTRL_S)
#define HP_ALIVE_SYS_HP_TCM_MEM_L0_LP_FORCE_CTRL_V  0x00000001U
#define HP_ALIVE_SYS_HP_TCM_MEM_L0_LP_FORCE_CTRL_S  3
/** HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_MODE : R/W; bitpos: [5:4]; default: 0;
 *  Configures layer1  hp_sram memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_MODE    0x00000003U
#define HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_MODE_M  (HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_MODE_V << HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_MODE_S)
#define HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_MODE_V  0x00000003U
#define HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_MODE_S  4
/** HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_EN : R/W; bitpos: [6]; default: 0;
 *  Set this bit to power down layer1 hp_sram memory.
 */
#define HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_EN    (BIT(6))
#define HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_EN_M  (HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_EN_V << HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_EN_S)
#define HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_TCM_L1_MEM_LP_EN_S  6
/** HP_ALIVE_SYS_HP_TCM_MEM_L1_LP_FORCE_CTRL : R/W; bitpos: [7]; default: 0;
 *  Set this bit to force software control layer1 hp_sram memory, disable hardware
 *  control.
 */
#define HP_ALIVE_SYS_HP_TCM_MEM_L1_LP_FORCE_CTRL    (BIT(7))
#define HP_ALIVE_SYS_HP_TCM_MEM_L1_LP_FORCE_CTRL_M  (HP_ALIVE_SYS_HP_TCM_MEM_L1_LP_FORCE_CTRL_V << HP_ALIVE_SYS_HP_TCM_MEM_L1_LP_FORCE_CTRL_S)
#define HP_ALIVE_SYS_HP_TCM_MEM_L1_LP_FORCE_CTRL_V  0x00000001U
#define HP_ALIVE_SYS_HP_TCM_MEM_L1_LP_FORCE_CTRL_S  7
/** HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_MODE : R/W; bitpos: [9:8]; default: 0;
 *  Configures layer2  hp_sram memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_MODE    0x00000003U
#define HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_MODE_M  (HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_MODE_V << HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_MODE_S)
#define HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_MODE_V  0x00000003U
#define HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_MODE_S  8
/** HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_EN : R/W; bitpos: [10]; default: 0;
 *  Set this bit to power down layer2 hp_sram memory.
 */
#define HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_EN    (BIT(10))
#define HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_EN_M  (HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_EN_V << HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_EN_S)
#define HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_TCM_L2_MEM_LP_EN_S  10
/** HP_ALIVE_SYS_HP_TCM_MEM_L2_LP_FORCE_CTRL : R/W; bitpos: [11]; default: 0;
 *  Set this bit to force software control layer2 hp_sram memory, disable hardware
 *  control.
 */
#define HP_ALIVE_SYS_HP_TCM_MEM_L2_LP_FORCE_CTRL    (BIT(11))
#define HP_ALIVE_SYS_HP_TCM_MEM_L2_LP_FORCE_CTRL_M  (HP_ALIVE_SYS_HP_TCM_MEM_L2_LP_FORCE_CTRL_V << HP_ALIVE_SYS_HP_TCM_MEM_L2_LP_FORCE_CTRL_S)
#define HP_ALIVE_SYS_HP_TCM_MEM_L2_LP_FORCE_CTRL_V  0x00000001U
#define HP_ALIVE_SYS_HP_TCM_MEM_L2_LP_FORCE_CTRL_S  11
/** HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_MODE : R/W; bitpos: [13:12]; default: 0;
 *  Configures layer3  hp_sram memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_MODE    0x00000003U
#define HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_MODE_M  (HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_MODE_V << HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_MODE_S)
#define HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_MODE_V  0x00000003U
#define HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_MODE_S  12
/** HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_EN : R/W; bitpos: [14]; default: 0;
 *  Set this bit to power down layer3 hp_sram memory.
 */
#define HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_EN    (BIT(14))
#define HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_EN_M  (HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_EN_V << HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_EN_S)
#define HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_EN_V  0x00000001U
#define HP_ALIVE_SYS_HP_TCM_L3_MEM_LP_EN_S  14
/** HP_ALIVE_SYS_HP_TCM_MEM_L3_LP_FORCE_CTRL : R/W; bitpos: [15]; default: 0;
 *  Set this bit to force software control layer3 hp_sram memory, disable hardware
 *  control.
 */
#define HP_ALIVE_SYS_HP_TCM_MEM_L3_LP_FORCE_CTRL    (BIT(15))
#define HP_ALIVE_SYS_HP_TCM_MEM_L3_LP_FORCE_CTRL_M  (HP_ALIVE_SYS_HP_TCM_MEM_L3_LP_FORCE_CTRL_V << HP_ALIVE_SYS_HP_TCM_MEM_L3_LP_FORCE_CTRL_S)
#define HP_ALIVE_SYS_HP_TCM_MEM_L3_LP_FORCE_CTRL_V  0x00000001U
#define HP_ALIVE_SYS_HP_TCM_MEM_L3_LP_FORCE_CTRL_S  15

/** HP_ALIVE_SYS_FLASH_MMU_MEM_LP_CTRL_REG register
 *  configure rmemory power in lp system register
 */
#define HP_ALIVE_SYS_FLASH_MMU_MEM_LP_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x2c)
/** HP_ALIVE_SYS_FLASH_MMU_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures flash_mmu memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define HP_ALIVE_SYS_FLASH_MMU_MEM_LP_MODE    0x00000003U
#define HP_ALIVE_SYS_FLASH_MMU_MEM_LP_MODE_M  (HP_ALIVE_SYS_FLASH_MMU_MEM_LP_MODE_V << HP_ALIVE_SYS_FLASH_MMU_MEM_LP_MODE_S)
#define HP_ALIVE_SYS_FLASH_MMU_MEM_LP_MODE_V  0x00000003U
#define HP_ALIVE_SYS_FLASH_MMU_MEM_LP_MODE_S  0
/** HP_ALIVE_SYS_FLASH_MMU_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down flash_mmu memory.
 */
#define HP_ALIVE_SYS_FLASH_MMU_MEM_LP_EN    (BIT(2))
#define HP_ALIVE_SYS_FLASH_MMU_MEM_LP_EN_M  (HP_ALIVE_SYS_FLASH_MMU_MEM_LP_EN_V << HP_ALIVE_SYS_FLASH_MMU_MEM_LP_EN_S)
#define HP_ALIVE_SYS_FLASH_MMU_MEM_LP_EN_V  0x00000001U
#define HP_ALIVE_SYS_FLASH_MMU_MEM_LP_EN_S  2
/** HP_ALIVE_SYS_FLASH_MMU_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control flash_mmu memory, disable hardware control.
 */
#define HP_ALIVE_SYS_FLASH_MMU_MEM_LP_FORCE_CTRL    (BIT(3))
#define HP_ALIVE_SYS_FLASH_MMU_MEM_LP_FORCE_CTRL_M  (HP_ALIVE_SYS_FLASH_MMU_MEM_LP_FORCE_CTRL_V << HP_ALIVE_SYS_FLASH_MMU_MEM_LP_FORCE_CTRL_S)
#define HP_ALIVE_SYS_FLASH_MMU_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_ALIVE_SYS_FLASH_MMU_MEM_LP_FORCE_CTRL_S  3

/** HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_CTRL_REG register
 *  configure rmemory power in lp system register
 */
#define HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x30)
/** HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures psram_mmu memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_MODE    0x00000003U
#define HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_MODE_M  (HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_MODE_V << HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_MODE_S)
#define HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_MODE_V  0x00000003U
#define HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_MODE_S  0
/** HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down psram_mmu memory.
 */
#define HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_EN    (BIT(2))
#define HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_EN_M  (HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_EN_V << HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_EN_S)
#define HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_EN_V  0x00000001U
#define HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_EN_S  2
/** HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control psram_mmu memory, disable hardware control.
 */
#define HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_FORCE_CTRL    (BIT(3))
#define HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_FORCE_CTRL_M  (HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_FORCE_CTRL_V << HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_FORCE_CTRL_S)
#define HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_ALIVE_SYS_PSRAM_MMU_MEM_LP_FORCE_CTRL_S  3

/** HP_ALIVE_SYS_SPRAM_MEM_AUX_CTRL_REG register
 *  spram mem aux ctrl , control TOP/CNNT/MODEM power domain
 */
#define HP_ALIVE_SYS_SPRAM_MEM_AUX_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x34)
/** HP_ALIVE_SYS_SPRAM_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304;
 *  spram mem aux ctrl , control TOP/CNNT/MODEM power domain
 */
#define HP_ALIVE_SYS_SPRAM_MEM_AUX_CTRL    0xFFFFFFFFU
#define HP_ALIVE_SYS_SPRAM_MEM_AUX_CTRL_M  (HP_ALIVE_SYS_SPRAM_MEM_AUX_CTRL_V << HP_ALIVE_SYS_SPRAM_MEM_AUX_CTRL_S)
#define HP_ALIVE_SYS_SPRAM_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_SPRAM_MEM_AUX_CTRL_S  0

