espressif/esp-idf/components/soc/esp32s31/register/soc/hp_alive_sys_reg.h
/** HP_ALIVE_SYS_SPRF_MEM_AUX_CTRL_REG register
 *  sprf mem aux ctrl , control TOP/CNNT power domain
 */
#define HP_ALIVE_SYS_SPRF_MEM_AUX_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x38)
/** HP_ALIVE_SYS_SPRF_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304;
 *  sprf mem aux ctrl , control TOP/CNNT/MODEM power domain
 */
#define HP_ALIVE_SYS_SPRF_MEM_AUX_CTRL    0xFFFFFFFFU
#define HP_ALIVE_SYS_SPRF_MEM_AUX_CTRL_M  (HP_ALIVE_SYS_SPRF_MEM_AUX_CTRL_V << HP_ALIVE_SYS_SPRF_MEM_AUX_CTRL_S)
#define HP_ALIVE_SYS_SPRF_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_SPRF_MEM_AUX_CTRL_S  0

/** HP_ALIVE_SYS_SDPRF_MEM_AUX_CTRL_REG register
 *  need_des
 */
#define HP_ALIVE_SYS_SDPRF_MEM_AUX_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x40)
/** HP_ALIVE_SYS_SDPRF_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 0;
 *  sdprf mem aux ctrl , control TOP/CNNT/MODEM power domain
 */
#define HP_ALIVE_SYS_SDPRF_MEM_AUX_CTRL    0xFFFFFFFFU
#define HP_ALIVE_SYS_SDPRF_MEM_AUX_CTRL_M  (HP_ALIVE_SYS_SDPRF_MEM_AUX_CTRL_V << HP_ALIVE_SYS_SDPRF_MEM_AUX_CTRL_S)
#define HP_ALIVE_SYS_SDPRF_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_SDPRF_MEM_AUX_CTRL_S  0

/** HP_ALIVE_SYS_CPU_SPROM_MEM_AUX_CTRL_REG register
 *  need_des
 */
#define HP_ALIVE_SYS_CPU_SPROM_MEM_AUX_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x44)
/** HP_ALIVE_SYS_CPU_SPROM_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 112;
 *  sprom mem aux ctrl , control CPU power domain
 */
#define HP_ALIVE_SYS_CPU_SPROM_MEM_AUX_CTRL    0xFFFFFFFFU
#define HP_ALIVE_SYS_CPU_SPROM_MEM_AUX_CTRL_M  (HP_ALIVE_SYS_CPU_SPROM_MEM_AUX_CTRL_V << HP_ALIVE_SYS_CPU_SPROM_MEM_AUX_CTRL_S)
#define HP_ALIVE_SYS_CPU_SPROM_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_CPU_SPROM_MEM_AUX_CTRL_S  0

/** HP_ALIVE_SYS_CPU_SPRF_MEM_AUX_CTRL_REG register
 *  need_des
 */
#define HP_ALIVE_SYS_CPU_SPRF_MEM_AUX_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x48)
/** HP_ALIVE_SYS_CPU_SPRF_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304;
 *  need_des
 */
#define HP_ALIVE_SYS_CPU_SPRF_MEM_AUX_CTRL    0xFFFFFFFFU
#define HP_ALIVE_SYS_CPU_SPRF_MEM_AUX_CTRL_M  (HP_ALIVE_SYS_CPU_SPRF_MEM_AUX_CTRL_V << HP_ALIVE_SYS_CPU_SPRF_MEM_AUX_CTRL_S)
#define HP_ALIVE_SYS_CPU_SPRF_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_CPU_SPRF_MEM_AUX_CTRL_S  0

/** HP_ALIVE_SYS_INTR_HP2LP_CONF_0_REG register
 *  intr hp2lp configuration register 0
 */
#define HP_ALIVE_SYS_INTR_HP2LP_CONF_0_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x7c)
/** HP_ALIVE_SYS_INTR_HP2LP_EN_0 : R/W; bitpos: [31:0]; default: 4294967295;
 *  reserved
 */
#define HP_ALIVE_SYS_INTR_HP2LP_EN_0    0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_EN_0_M  (HP_ALIVE_SYS_INTR_HP2LP_EN_0_V << HP_ALIVE_SYS_INTR_HP2LP_EN_0_S)
#define HP_ALIVE_SYS_INTR_HP2LP_EN_0_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_EN_0_S  0

/** HP_ALIVE_SYS_INTR_HP2LP_CONF_1_REG register
 *  intr hp2lp configuration register 1
 */
#define HP_ALIVE_SYS_INTR_HP2LP_CONF_1_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x80)
/** HP_ALIVE_SYS_INTR_HP2LP_EN_1 : R/W; bitpos: [31:0]; default: 4294967295;
 *  reserved
 */
#define HP_ALIVE_SYS_INTR_HP2LP_EN_1    0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_EN_1_M  (HP_ALIVE_SYS_INTR_HP2LP_EN_1_V << HP_ALIVE_SYS_INTR_HP2LP_EN_1_S)
#define HP_ALIVE_SYS_INTR_HP2LP_EN_1_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_EN_1_S  0

/** HP_ALIVE_SYS_INTR_HP2LP_CONF_2_REG register
 *  intr hp2lp configuration register 2
 */
#define HP_ALIVE_SYS_INTR_HP2LP_CONF_2_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x84)
/** HP_ALIVE_SYS_INTR_HP2LP_EN_2 : R/W; bitpos: [31:0]; default: 4294967295;
 *  reserved
 */
#define HP_ALIVE_SYS_INTR_HP2LP_EN_2    0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_EN_2_M  (HP_ALIVE_SYS_INTR_HP2LP_EN_2_V << HP_ALIVE_SYS_INTR_HP2LP_EN_2_S)
#define HP_ALIVE_SYS_INTR_HP2LP_EN_2_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_EN_2_S  0

/** HP_ALIVE_SYS_INTR_HP2LP_CONF_3_REG register
 *  intr hp2lp configuration register 3
 */
#define HP_ALIVE_SYS_INTR_HP2LP_CONF_3_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x88)
/** HP_ALIVE_SYS_INTR_HP2LP_EN_3 : R/W; bitpos: [31:0]; default: 4294967295;
 *  reserved
 */
#define HP_ALIVE_SYS_INTR_HP2LP_EN_3    0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_EN_3_M  (HP_ALIVE_SYS_INTR_HP2LP_EN_3_V << HP_ALIVE_SYS_INTR_HP2LP_EN_3_S)
#define HP_ALIVE_SYS_INTR_HP2LP_EN_3_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_EN_3_S  0

/** HP_ALIVE_SYS_INTR_HP2LP_CONF_4_REG register
 *  intr hp2lp configuration register 4
 */
#define HP_ALIVE_SYS_INTR_HP2LP_CONF_4_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x8c)
/** HP_ALIVE_SYS_INTR_HP2LP_EN_4 : R/W; bitpos: [7:0]; default: 255;
 *  reserved
 */
#define HP_ALIVE_SYS_INTR_HP2LP_EN_4    0x000000FFU
#define HP_ALIVE_SYS_INTR_HP2LP_EN_4_M  (HP_ALIVE_SYS_INTR_HP2LP_EN_4_V << HP_ALIVE_SYS_INTR_HP2LP_EN_4_S)
#define HP_ALIVE_SYS_INTR_HP2LP_EN_4_V  0x000000FFU
#define HP_ALIVE_SYS_INTR_HP2LP_EN_4_S  0

/** HP_ALIVE_SYS_INTR_HP2LP_STATUS_0_REG register
 *  intr hp2lp status register 0
 */
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_0_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x90)
/** HP_ALIVE_SYS_INTR_HP2LP_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_0    0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_0_M  (HP_ALIVE_SYS_INTR_HP2LP_STATUS_0_V << HP_ALIVE_SYS_INTR_HP2LP_STATUS_0_S)
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_0_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_0_S  0

/** HP_ALIVE_SYS_INTR_HP2LP_STATUS_1_REG register
 *  intr hp2lp status register 1
 */
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_1_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x94)
/** HP_ALIVE_SYS_INTR_HP2LP_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_1    0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_1_M  (HP_ALIVE_SYS_INTR_HP2LP_STATUS_1_V << HP_ALIVE_SYS_INTR_HP2LP_STATUS_1_S)
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_1_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_1_S  0

/** HP_ALIVE_SYS_INTR_HP2LP_STATUS_2_REG register
 *  intr hp2lp status register 2
 */
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_2_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x98)
/** HP_ALIVE_SYS_INTR_HP2LP_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_2    0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_2_M  (HP_ALIVE_SYS_INTR_HP2LP_STATUS_2_V << HP_ALIVE_SYS_INTR_HP2LP_STATUS_2_S)
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_2_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_2_S  0

/** HP_ALIVE_SYS_INTR_HP2LP_STATUS_3_REG register
 *  intr hp2lp status register 3
 */
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_3_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x9c)
/** HP_ALIVE_SYS_INTR_HP2LP_STATUS_3 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_3    0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_3_M  (HP_ALIVE_SYS_INTR_HP2LP_STATUS_3_V << HP_ALIVE_SYS_INTR_HP2LP_STATUS_3_S)
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_3_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_3_S  0

/** HP_ALIVE_SYS_INTR_HP2LP_STATUS_4_REG register
 *  intr hp2lp status register 4
 */
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_4_REG (DR_REG_HP_ALIVE_SYS_BASE + 0xa0)
/** HP_ALIVE_SYS_INTR_HP2LP_STATUS_4 : RO; bitpos: [7:0]; default: 0;
 *  reserved
 */
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_4    0x000000FFU
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_4_M  (HP_ALIVE_SYS_INTR_HP2LP_STATUS_4_V << HP_ALIVE_SYS_INTR_HP2LP_STATUS_4_S)
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_4_V  0x000000FFU
#define HP_ALIVE_SYS_INTR_HP2LP_STATUS_4_S  0

/** HP_ALIVE_SYS_CPU_SPRAM_MEM_AUX_CTRL_REG register
 *  spram mem aux ctrl , control CPU power domain
 */
#define HP_ALIVE_SYS_CPU_SPRAM_MEM_AUX_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0xa4)
/** HP_ALIVE_SYS_CPU_SPRAM_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304;
 *  spram mem aux ctrl , control CPU power domain
 */
#define HP_ALIVE_SYS_CPU_SPRAM_MEM_AUX_CTRL    0xFFFFFFFFU
#define HP_ALIVE_SYS_CPU_SPRAM_MEM_AUX_CTRL_M  (HP_ALIVE_SYS_CPU_SPRAM_MEM_AUX_CTRL_V << HP_ALIVE_SYS_CPU_SPRAM_MEM_AUX_CTRL_S)
#define HP_ALIVE_SYS_CPU_SPRAM_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define HP_ALIVE_SYS_CPU_SPRAM_MEM_AUX_CTRL_S  0

/** HP_ALIVE_SYS_BUS_CLOCK_GATE_BYPASS_REG register
 *  bus clock gating bypass configuration register
 */
#define HP_ALIVE_SYS_BUS_CLOCK_GATE_BYPASS_REG (DR_REG_HP_ALIVE_SYS_BASE + 0xa8)
/** HP_ALIVE_SYS_AHB_CLK_GATING_BYPASS : R/W; bitpos: [0]; default: 1;
 *  Set 1 to bypass the clock gating for ahb bus
 */
#define HP_ALIVE_SYS_AHB_CLK_GATING_BYPASS    (BIT(0))
#define HP_ALIVE_SYS_AHB_CLK_GATING_BYPASS_M  (HP_ALIVE_SYS_AHB_CLK_GATING_BYPASS_V << HP_ALIVE_SYS_AHB_CLK_GATING_BYPASS_S)
#define HP_ALIVE_SYS_AHB_CLK_GATING_BYPASS_V  0x00000001U
#define HP_ALIVE_SYS_AHB_CLK_GATING_BYPASS_S  0
/** HP_ALIVE_SYS_APB_CLK_GATING_BYPASS : R/W; bitpos: [1]; default: 1;
 *  Set 1 to bypass the clock gating for apb bus
 */
#define HP_ALIVE_SYS_APB_CLK_GATING_BYPASS    (BIT(1))
#define HP_ALIVE_SYS_APB_CLK_GATING_BYPASS_M  (HP_ALIVE_SYS_APB_CLK_GATING_BYPASS_V << HP_ALIVE_SYS_APB_CLK_GATING_BYPASS_S)
#define HP_ALIVE_SYS_APB_CLK_GATING_BYPASS_V  0x00000001U
#define HP_ALIVE_SYS_APB_CLK_GATING_BYPASS_S  1
/** HP_ALIVE_SYS_AXI_CLK_GATING_BYPASS : R/W; bitpos: [2]; default: 1;
 *  Set 1 to bypass the clock gating for axi bus
 */
#define HP_ALIVE_SYS_AXI_CLK_GATING_BYPASS    (BIT(2))
#define HP_ALIVE_SYS_AXI_CLK_GATING_BYPASS_M  (HP_ALIVE_SYS_AXI_CLK_GATING_BYPASS_V << HP_ALIVE_SYS_AXI_CLK_GATING_BYPASS_S)
#define HP_ALIVE_SYS_AXI_CLK_GATING_BYPASS_V  0x00000001U
#define HP_ALIVE_SYS_AXI_CLK_GATING_BYPASS_S  2
/** HP_ALIVE_SYS_MEM_CLK_GATING_BYPASS : R/W; bitpos: [3]; default: 1;
 *  Set 1 to bypass the clock gating for mem bus
 */
#define HP_ALIVE_SYS_MEM_CLK_GATING_BYPASS    (BIT(3))
#define HP_ALIVE_SYS_MEM_CLK_GATING_BYPASS_M  (HP_ALIVE_SYS_MEM_CLK_GATING_BYPASS_V << HP_ALIVE_SYS_MEM_CLK_GATING_BYPASS_S)
#define HP_ALIVE_SYS_MEM_CLK_GATING_BYPASS_V  0x00000001U
#define HP_ALIVE_SYS_MEM_CLK_GATING_BYPASS_S  3
/** HP_ALIVE_SYS_AHB_MTX_CLK_GATING_BYPASS : R/W; bitpos: [4]; default: 1;
 *  Set 1 to bypass the clock gating for ahb mtx
 */
#define HP_ALIVE_SYS_AHB_MTX_CLK_GATING_BYPASS    (BIT(4))
#define HP_ALIVE_SYS_AHB_MTX_CLK_GATING_BYPASS_M  (HP_ALIVE_SYS_AHB_MTX_CLK_GATING_BYPASS_V << HP_ALIVE_SYS_AHB_MTX_CLK_GATING_BYPASS_S)
#define HP_ALIVE_SYS_AHB_MTX_CLK_GATING_BYPASS_V  0x00000001U
#define HP_ALIVE_SYS_AHB_MTX_CLK_GATING_BYPASS_S  4

/** HP_ALIVE_SYS_RST_EVENT_BYPASS_REG register
 *  bus clock gating bypass configuration register
 */
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_REG (DR_REG_HP_ALIVE_SYS_BASE + 0xac)
/** HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMAPB : R/W; bitpos: [0]; default: 0;
 *  Set 1 to bypass none-power_on reset source
 */
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMAPB    (BIT(0))
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMAPB_M  (HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMAPB_V << HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMAPB_S)
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMAPB_V  0x00000001U
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMAPB_S  0
/** HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMSYS : R/W; bitpos: [1]; default: 0;
 *  Set 1 to bypass none-power_on reset source
 */
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMSYS    (BIT(1))
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMSYS_M  (HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMSYS_V << HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMSYS_S)
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMSYS_V  0x00000001U
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMSYS_S  1
/** HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMCPU : R/W; bitpos: [2]; default: 0;
 *  Set 1 to bypass none-power_on reset source
 */
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMCPU    (BIT(2))
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMCPU_M  (HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMCPU_V << HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMCPU_S)
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMCPU_V  0x00000001U
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_ICMCPU_S  2
/** HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST : R/W; bitpos: [3]; default: 1;
 *  Set 1 to bypass none-power_on reset source
 */
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST    (BIT(3))
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST_M  (HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST_V << HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST_S)
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST_V  0x00000001U
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST_S  3
/** HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST_REG : R/W; bitpos: [4]; default: 0;
 *  Set 1 to bypass none-power_on reset source
 */
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST_REG    (BIT(4))
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST_REG_M  (HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST_REG_V << HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST_REG_S)
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST_REG_V  0x00000001U
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_CLKRST_REG_S  4
/** HP_ALIVE_SYS_RST_EVENT_BYPASS_IOMUX : R/W; bitpos: [5]; default: 0;
 *  Set 1 to bypass none-power_on reset source
 */
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_IOMUX    (BIT(5))
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_IOMUX_M  (HP_ALIVE_SYS_RST_EVENT_BYPASS_IOMUX_V << HP_ALIVE_SYS_RST_EVENT_BYPASS_IOMUX_S)
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_IOMUX_V  0x00000001U
#define HP_ALIVE_SYS_RST_EVENT_BYPASS_IOMUX_S  5
/** HP_ALIVE_SYS_RST_BYPASS_LOCK : R/W; bitpos: [6]; default: 0;
 *  Set 1 to lock reset event bypass configuration
 */
#define HP_ALIVE_SYS_RST_BYPASS_LOCK    (BIT(6))
#define HP_ALIVE_SYS_RST_BYPASS_LOCK_M  (HP_ALIVE_SYS_RST_BYPASS_LOCK_V << HP_ALIVE_SYS_RST_BYPASS_LOCK_S)
#define HP_ALIVE_SYS_RST_BYPASS_LOCK_V  0x00000001U
#define HP_ALIVE_SYS_RST_BYPASS_LOCK_S  6

/** HP_ALIVE_SYS_USB_OTGHS_CTRL_REG register
 *  usb_otghs Control configuration register
 */
#define HP_ALIVE_SYS_USB_OTGHS_CTRL_REG (DR_REG_HP_ALIVE_SYS_BASE + 0xb0)
/** HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_FORCE_EN : R/W; bitpos: [0]; default: 0;
 *  Set this bit as 1 to force use reg_usb_otghs_phy_pll_en
 */
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_FORCE_EN    (BIT(0))
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_FORCE_EN_M  (HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_FORCE_EN_V << HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_FORCE_EN_S)
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_FORCE_EN_V  0x00000001U
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_FORCE_EN_S  0
/** HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_EN : R/W; bitpos: [1]; default: 0;
 *  pll_en for phy inf
 */
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_EN    (BIT(1))
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_EN_M  (HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_EN_V << HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_EN_S)
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_EN_V  0x00000001U
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_PLL_EN_S  1
/** HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM_FORCE_EN : R/W; bitpos: [2]; default: 1;
 *  Set this bit as 1 to force use reg_usb_otghs_phy_suspendm
 */
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM_FORCE_EN    (BIT(2))
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM_FORCE_EN_M  (HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM_FORCE_EN_V << HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM_FORCE_EN_S)
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM_FORCE_EN_V  0x00000001U
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM_FORCE_EN_S  2
/** HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM : R/W; bitpos: [3]; default: 0;
 *  phy suspendm
 */
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM    (BIT(3))
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM_M  (HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM_V << HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM_S)
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM_V  0x00000001U
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SUSPENDM_S  3
/** HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET_FORCE_EN : R/W; bitpos: [4]; default: 0;
 *  Set this bit as 1 to force use reg_usb_otghs_phy_reset
 */
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET_FORCE_EN    (BIT(4))
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET_FORCE_EN_M  (HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET_FORCE_EN_V << HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET_FORCE_EN_S)
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET_FORCE_EN_V  0x00000001U
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET_FORCE_EN_S  4
/** HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET : R/W; bitpos: [5]; default: 0;
 *  phy reset
 */
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET    (BIT(5))
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET_M  (HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET_V << HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET_S)
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET_V  0x00000001U
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_RESET_S  5
/** HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TXBITSTUFF_EN : R/W; bitpos: [6]; default: 0;
 *  phy txbitstuff_en
 */
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TXBITSTUFF_EN    (BIT(6))
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TXBITSTUFF_EN_M  (HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TXBITSTUFF_EN_V << HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TXBITSTUFF_EN_S)
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TXBITSTUFF_EN_V  0x00000001U
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TXBITSTUFF_EN_S  6
/** HP_ALIVE_SYS_REG_USB_OTGHS_PHY_OTG_SUSPENDM : R/W; bitpos: [7]; default: 0;
 *  phy otg_suspendm
 */
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_OTG_SUSPENDM    (BIT(7))
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_OTG_SUSPENDM_M  (HP_ALIVE_SYS_REG_USB_OTGHS_PHY_OTG_SUSPENDM_V << HP_ALIVE_SYS_REG_USB_OTGHS_PHY_OTG_SUSPENDM_S)
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_OTG_SUSPENDM_V  0x00000001U
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_OTG_SUSPENDM_S  7
/** HP_ALIVE_SYS_REG_USB_OTGHS_PHY_REFCLK_MODE : R/W; bitpos: [8]; default: 1;
 *  phy refclk_mode
 */
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_REFCLK_MODE    (BIT(8))
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_REFCLK_MODE_M  (HP_ALIVE_SYS_REG_USB_OTGHS_PHY_REFCLK_MODE_V << HP_ALIVE_SYS_REG_USB_OTGHS_PHY_REFCLK_MODE_S)
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_REFCLK_MODE_V  0x00000001U
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_REFCLK_MODE_S  8
/** HP_ALIVE_SYS_REG_USB_OTGHS_CORE_SS_SCALEDOWN_MODE : R/W; bitpos: [10:9]; default: 0;
 *  usb otghs core ss_scaledown_mode
 */
#define HP_ALIVE_SYS_REG_USB_OTGHS_CORE_SS_SCALEDOWN_MODE    0x00000003U
#define HP_ALIVE_SYS_REG_USB_OTGHS_CORE_SS_SCALEDOWN_MODE_M  (HP_ALIVE_SYS_REG_USB_OTGHS_CORE_SS_SCALEDOWN_MODE_V << HP_ALIVE_SYS_REG_USB_OTGHS_CORE_SS_SCALEDOWN_MODE_S)
#define HP_ALIVE_SYS_REG_USB_OTGHS_CORE_SS_SCALEDOWN_MODE_V  0x00000003U
#define HP_ALIVE_SYS_REG_USB_OTGHS_CORE_SS_SCALEDOWN_MODE_S  9
/** HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SELF_TEST : R/W; bitpos: [11]; default: 0;
 *  phy self_test
 */
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SELF_TEST    (BIT(11))
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SELF_TEST_M  (HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SELF_TEST_V << HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SELF_TEST_S)
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SELF_TEST_V  0x00000001U
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_SELF_TEST_S  11
/** HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TEST_DONE : RO; bitpos: [12]; default: 0;
 *  phy test_bist
 */
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TEST_DONE    (BIT(12))
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TEST_DONE_M  (HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TEST_DONE_V << HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TEST_DONE_S)
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TEST_DONE_V  0x00000001U
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_TEST_DONE_S  12
/** HP_ALIVE_SYS_REG_USB_OTGHS_PHY_DTO : RO; bitpos: [13]; default: 0;
 *  phy dto
 */
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_DTO    (BIT(13))
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_DTO_M  (HP_ALIVE_SYS_REG_USB_OTGHS_PHY_DTO_V << HP_ALIVE_SYS_REG_USB_OTGHS_PHY_DTO_S)
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_DTO_V  0x00000001U
#define HP_ALIVE_SYS_REG_USB_OTGHS_PHY_DTO_S  13

/** HP_ALIVE_SYS_DATE_REG register
 *  need_des
 */
#define HP_ALIVE_SYS_DATE_REG (DR_REG_HP_ALIVE_SYS_BASE + 0x3fc)
/** HP_ALIVE_SYS_DATE : R/W; bitpos: [30:0]; default: 38834448;
 *  need_des
 */
#define HP_ALIVE_SYS_DATE    0x7FFFFFFFU
#define HP_ALIVE_SYS_DATE_M  (HP_ALIVE_SYS_DATE_V << HP_ALIVE_SYS_DATE_S)
#define HP_ALIVE_SYS_DATE_V  0x7FFFFFFFU
#define HP_ALIVE_SYS_DATE_S  0
/** HP_ALIVE_SYS_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define HP_ALIVE_SYS_CLK_EN    (BIT(31))
#define HP_ALIVE_SYS_CLK_EN_M  (HP_ALIVE_SYS_CLK_EN_V << HP_ALIVE_SYS_CLK_EN_S)
#define HP_ALIVE_SYS_CLK_EN_V  0x00000001U
#define HP_ALIVE_SYS_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
